# To Do List

It would be foolish to start messing around with such a large dataset without knowing exactly what you're trying to get out of it. So you  have  to clarify the process and outcomes for this project. You come up with the following list of steps and deliverables:<br><br>

* Import your data into a Pandas DataFrame.<br><br>
* Merge your DataFrames.<br><br>
* Create a bubble chart that showcases the average fare versus the total number of rides with bubble size based on the total number of drivers for each city type, including urban, suburban, and rural.<br><br>
* Determine the mean, median, and mode for the following:<br><br>
    * The total number of rides for each city type.
    * The average fares for each city type.
    * The total number of drivers for each city type.<br><br>
* Create box-and-whisker plots that visualize each of the following to determine if there are any outliers:<br><br>
    * The number of rides for each city type.
    * The fares for each city type.
    * The number of drivers for each city type.<br><br>
* Create a pie chart that visualizes each of the following data for each city type:<br><br>
    * The percent of total fares.
    * The percent of total rides.
    * The percent of total drivers.

# Load And Read The csv Files

In [1]:
#add dependencies
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import os

In [2]:
# Files to load
city_data_to_load = os.path.join("resources_5/","city_data.csv")
ride_data_to_load = os.path.join("resources_5/","ride_data.csv")

In [3]:
#read city data
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [4]:
# read ride data
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

# explore the data in pandas

<h2> inspect the city data dataframe

For the city_data_df DataFrame, we need to:

* Get all the rows that contain null values.
* Make sure the driver_count column has an integer data type.
* Find out how many data points there are for each type of city.<br><br>
First, let's get all the rows that are not null.

We'll use the df.count() method to find the names of our columns and the number of rows that are not null.

In [43]:
#get shape of city df
city_data_df.shape

(120, 3)

In [45]:
#head city df
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [46]:
#tail city df
city_data_df.tail()

                city  driver_count   type
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

In [14]:
# get the columns and the rows that are not null
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

And to make sure there are no null values, we can type and run the following code:

In [17]:
# get the columns and the rows that are not null
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

The output from this code shows that there are zero null values in all three columns.<br><br>

Next, we need to see if the driver_count column has a numerical data type because we plan to perform mathematical calculations on that column.

In [23]:
# get the data types of each column
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

Finally, we'll check to see how many data points there are for each type of city. To do this, we'll use the sum() method on the city_data_df for the type column where the condition equals each city in the DataFrame.

We can use the unique() method on a specific column, which will return an array, or list, of all the unique values of that column

In [24]:
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

Now we can use the sum() method on the city_data_df for the type column where the condition equals either Urban, Suburban, or Rural.

To get the number of data points for the Urban cities, add the following code to a new cell:

In [26]:
sum(city_data_df["type"]=="Urban")

66

In [27]:
sum(city_data_df["type"]=="Suburban")

36

In [28]:
sum(city_data_df["type"]=="Rural")

18

<h2> inspect ride data dataframe

For the ride_data_df DataFrame, we need to:
<br><br>
* Get all the rows that contain null values.
* Make sure the fare and ride_id columns are numerical data types.<br><br>
First, let's get all the rows that are not null. Add the following code:

In [37]:
# shape of the dataset
ride_data_df.shape

(2375, 4)

In [41]:
# head ride df
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [47]:
#tail ride df
ride_data_df.tail(10)

                 city                 date   fare        ride_id
2365       Lake Jamie  2019-04-19 04:32:47  16.29  3518682119233
2366      North Holly  2019-03-18 10:38:05  40.34  3787775176860
2367      Michaelberg  2019-01-27 18:43:05  38.42   862622008020
2368       Lake Jamie  2019-04-29 01:58:44  54.22  2489264790267
2369     Bradshawfurt  2019-01-30 10:55:23  51.39  1328274868072
2370      Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371  Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372      North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373     West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374       Newtonview  2019-04-25 10:20:13  55.84  9990581345298

In [32]:
#get the columns and rows that are not null
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [34]:
#get the columns and rows that are not null
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

The output from this code shows that there are zero null values in all three columns.

Next, we need to determine if the fare and ride_id columns are numerical data types so that we can perform mathematical calculations on those columns.

In [35]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

Run the cell. The output shows the data types for each column. And more importantly, the data types for the fare and ride_id columns are floating-point decimal, and integer, respectively.

In [39]:
#info on ride df
ride_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2375 entries, 0 to 2374
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   city     2375 non-null   object
 1   date     2375 non-null   object
 2   fare     2375 non-null   float64
 3   ride_id  2375 non-null   int64
dtypes: float64(1), int64(1), object(2)
memory usage: 74.3+ KB

Both of the DataFrames look good and can now be merged.

# Merge Data Frames

In [48]:
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [49]:
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

Before we merge the DataFrames, let's review each DataFrame.<br><br>

The columns in the city_data_df DataFrame are:<br><br>

* city
* driver_count
* type<br><br>
The columns in the ride_data_df are:<br><br>

* city
* date
* fare
* ride_id

When we merge two DataFrames, we merge on a column with the same data, and the same column name, in both DataFrames. We use the following syntax to do that:

new_df = pd.merge(leftdf, rightdf, on=["column_leftdf", "column_rightdf"])

We may have to merge the DataFrames using the how= parameter either left, right, inner, or outer depending how we want to merge the DataFrames. The default is inner.

Looking at the columns in the two DataFrames, we can see that the column the DataFrames have in common is city. Therefore, we will merge the two DataFrames on the city column, and then add the city_data_df to the end of the ride_data_df DataFrame with the constraint how="left".

Add the following code to a new cell and run the cell to merge the two DataFrames.

In [66]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In the pyber_data_df DataFrame, all the columns from the city_data_df are the first four columns after the index. The driver_count and type columns from the ride_data_df are added at the end, as shown in the following image:

!['triple_data_frame'](./resources_5/triple_data_frame.png)